-- =========================================================================
-- ИСПРАВЛЕНИЕ ДЕКОРАТИВНЫХ ТЕЛ НА РАСКОПКАХ БЕЙЛ'ДАН (ЮЖНЫЕ СТЕПИ)
-- 36869 — Тело бейл'данского землекопа
-- 36870 — Тело бейл'данского оценщика
-- =========================================================================

UPDATE `creature_template` SET 
    `unit_flags` = 33587712,      -- UNIT_FLAG_NOT_SELECTABLE (убирает рамку таргета, делает некликабельным)
    `dynamicflags` = 32,          -- UNIT_DYNFLAG_DEAD (моделька принудительно ложится на землю трупом)
    `flags_extra` = 2,            -- CREATURE_FLAG_EXTRA_TRIGGER (отключает ИИ на уровне ядра)
    `AIName` = '',                -- Выключаем SmartAI, чтобы существа не «оживали»
    `ScriptName` = '' 
WHERE `entry` IN (36869, 36870);
